GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/STM32MCP/STM32MCP.c
}
/*********************************************************************
 * @fn      STM32MCP_setEscooterControlDebugFrame
 *
 * @brief   It is used for sending EScooter Control DEBUG frame
 *
 * @param   None
 *
 *
 * @return  None
 */
void STM32MCP_setEscooterControlDebugFrame(uint8_t debugID)
{
     //Insert Into Packet
    uint8_t *txFrame = (uint8_t *)malloc(sizeof(uint8_t)*(STM32MCP_ESCOOTER_CONTROL_DEBUG_PAYLOAD_LENGTH + 3));
    txFrame[0] = STM32MCP_MOTOR_1_ID | STM32MCP_ESCOOTER_CONTROL_DEBUG_FRAME_ID;
    txFrame[1] = STM32MCP_ESCOOTER_CONTROL_DEBUG_PAYLOAD_LENGTH;
    txFrame[2] = debugID;
    txFrame[3] = STM32MCP_calChecksum(txFrame,3);
    //Insert it into the queue
    if(STM32MCP_queueIsEmpty())
    {
        STM32MCP_timerManager->timerStart();
        STM32MCP_enqueueMsg(txFrame,4);
        STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg, STM32MCP_headPtr->size);
    }
    else
    {
        STM32MCP_enqueueMsg(txFrame, 4);
    }
}

/*********************************************************************
 * @fn      STM32MCP_setTorqueRampConfiguration
 *
 * @brief   It is used for configuring driving modes: Ambler, Leisure and Sport with different Speed and Torque limits
 *          as well as acceleration and deceleration ramps.
 *
 * @param   torqueIQ :      maximum allowable torques (s16A)
 *          allowableSpeed: maximum allowable speed  (RPM)
 *          rampRate:       time durations for acceleration / deceleration in milliseconds
 *
 * @return  None
 */
void STM32MCP_setSpeedModeConfiguration(int32_t torqueIQ, int32_t allowableSpeed, uint16_t rampRate)
{
    if(communicationState == STM32MCP_COMMUNICATION_ACTIVE)
    {
       //Make a payload and insert into the packet
        uint8_t *txFrame = (uint8_t*)malloc(sizeof(uint8_t)*(STM32MCP_SET_DRIVING_MODE_CONFIG_PAYLOAD_LENGTH + 3));
        txFrame[0]   = STM32MCP_MOTOR_1_ID | STM32MCP_SET_DRIVE_MODE_CONFIG_FRAME_ID;
        txFrame[1]   = STM32MCP_SET_DRIVING_MODE_CONFIG_PAYLOAD_LENGTH;
        txFrame[2]   = torqueIQ               & 0xFF;
        txFrame[3]   = (torqueIQ >> 8)        & 0xFF;
        txFrame[4]   = (torqueIQ >> 16)       & 0xFF;
        txFrame[5]   = (torqueIQ >> 24)       & 0xFF;
        txFrame[6]   =  allowableSpeed        & 0xFF;
        txFrame[7]   = (allowableSpeed >> 8)  & 0xFF;
        txFrame[8]   = (allowableSpeed >> 16) & 0xFF;
        txFrame[9]   = (allowableSpeed >> 24) & 0xFF;
        txFrame[10]  =  rampRate              & 0xFF;
        txFrame[11]  = (rampRate >> 8)        & 0xFF;
        txFrame[12]  = STM32MCP_calChecksum(txFrame,12);
        if(STM32MCP_queueIsEmpty())
        {
            STM32MCP_timerManager->timerStart();
            STM32MCP_enqueueMsg(txFrame,STM32MCP_SET_DRIVING_MODE_CONFIG_PAYLOAD_LENGTH + 3);
            STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg,STM32MCP_headPtr->size);
        }
        else
        {
            STM32MCP_enqueueMsg(txFrame, STM32MCP_SET_DRIVING_MODE_CONFIG_PAYLOAD_LENGTH+3);
        }
    }
}
/*********************************************************************
 * @fn      STM32MCP_setDynamicCurrent
 *
 * @brief   It is used for changing the IQ instantly in order to change the Motor's speed
 *
 * @param   allowableSpeed:      maximum allowable torques (RPM)
 *          IQValue:             instant Current  (s16A)
 *
 * @return  None
 */
void STM32MCP_setDynamicCurrent(int16_t allowableSpeed, int16_t IQValue)
{
    if(communicationState == STM32MCP_COMMUNICATION_ACTIVE)
    {
       //Make a payload and insert into the packet
        uint8_t *txFrame = (uint8_t*)malloc(sizeof(uint8_t)*(STM32MCP_SET_DYNAMIC_TORQUE_FRAME_PAYLOAD_LENGTH + 3));
        txFrame[0]   = STM32MCP_MOTOR_1_ID | STM32MCP_SET_DYNAMIC_TORQUE_FRAME_ID;
        txFrame[1]   = STM32MCP_SET_DYNAMIC_TORQUE_FRAME_PAYLOAD_LENGTH;
        txFrame[2]  =  allowableSpeed         & 0xFF;
        txFrame[3]  = (allowableSpeed >> 8)   & 0xFF;
        txFrame[4]  = (allowableSpeed >> 16)  & 0xFF;
        txFrame[5]  = (allowableSpeed >> 24)  & 0xFF;
        txFrame[6]  =  IQValue        & 0xFF;
        txFrame[7]  = (IQValue >> 8)  & 0xFF;
        txFrame[8]  = (IQValue >> 16) & 0xFF;
        txFrame[9]  = (IQValue >> 24) & 0xFF;
        txFrame[10] = STM32MCP_calChecksum(txFrame,10);
        if(STM32MCP_queueIsEmpty())
        {
            STM32MCP_timerManager -> timerStart();
            STM32MCP_enqueueMsg(txFrame,STM32MCP_SET_DYNAMIC_TORQUE_FRAME_PAYLOAD_LENGTH + 3);
            STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg, STM32MCP_headPtr->size);
        }
        else
        {
            STM32MCP_enqueueMsg(txFrame,STM32MCP_SET_DYNAMIC_TORQUE_FRAME_PAYLOAD_LENGTH + 3);
        }

    }
}

/*********************************************************************
 * @fn      STM32MCP_EscooterShutdown
 *
 * @brief   Sends shutdown command to turn off Motor Controller
 *
 * @param   sysCmdId: STM32MCP_POWER_OFF ( 0x00 )
 *
 * @return  None
 */
void STM32MCP_EscooterShutdown(uint8_t sysCmdId)
{
    //Insert into packet
    uint8_t *txFrame = (uint8_t *) malloc(sizeof(uint8_t) * (STM32MCP_SET_SYSTEM_CONTROL_CONFIG_PAYLOAD_LENGTH + 3));
    txFrame[0] = STM32MCP_MOTOR_1_ID | STM32MCP_SET_SYSTEM_CONTROL_CONFIG_FRAME_ID;
    txFrame[1] = STM32MCP_SET_SYSTEM_CONTROL_CONFIG_PAYLOAD_LENGTH;
    txFrame[2] = sysCmdId;
    txFrame[3] = STM32MCP_calChecksum(txFrame, 3);
    STM32MCP_uartManager->uartWrite(txFrame, 4);
}

/*********************************************************************
 * @fn      STM32MCP_setRegisterAttribute
 *
 * @brief   It is used to set motor control register attribute table INSIDE this file
 *
 * @param   motorID: The target motor
 *          regID: The register ID
 *          payloadLength: The length of the payload
 *          payload: The memory address of the payload
 *
 *
 * @return  checksum of the txMessage
 */
void STM32MCP_setRegisterAttribute(uint8_t motorID, uint8_t regID, uint8_t payloadLength, uint8_t *payload)
{
    //Do not do memory allocation, since it points to the server register. If you free it, the whole server will crake down
    STM32MCP_regAttribute_t *MCP_Register = STM32MCP_findRegister(motorID, regID);
    if(MCP_Register != NULL)
    {
        memcpy(MCP_Register->payload, payload, payloadLength);
    }
}
/*********************************************************************
 * @fn      STM32MCP_getRegisterAttribute
 *
 * @brief   It is used to get motor control register attribute table INSIDE this file
 *
 * @param   motorID: The target motor
 *          regID: The register ID
 *
 *
 * @return  A register Attribute
 */
STM32MCP_regAttribute_t *STM32MCP_getRegisterAttribute(uint8_t motorID, uint8_t regID)
{
    //Do not do memory allocation, since it points to the server register. If you free it, the whole server will crake down
    STM32MCP_regAttribute_t *MCP_Register = STM32MCP_findRegister(motorID, regID);
    if(MCP_Register != NULL)
    {
        return MCP_Register;
    }
    return (STM32MCP_regAttribute_t *)NULL;
}
/*********************************************************************
 * @fn      STM32MCP_setBoardInfo
 *
 * @brief   It is used to set the boardInfo (Note: This function does not set new board info in the motor controller.
 *          It is just a local function to set a pointer variable in this file
 *
 * @param   msg: The message
 *          The size of the message
 *
 *
 * @return  none
 */
void STM32MCP_setBoardInfo(uint8_t *msg, uint8_t size)
{
    free(boardInfoMsg);
    boardInfoMsg = (uint8_t *) malloc(sizeof(uint8_t) * size);
    memcpy(boardInfoMsg, msg, size);
}
/*********************************************************************
 * @fn      STM32MCP_flowControlHandler
 *
 * @brief   It is used for handling flow control and data packing
 *          Configure Uart interrupt to receive one byte
 *          pass the byte to this function
 *
 * @param   receivedByte: The byte received from uart receiver
 *          rxObj:      An object representing the received message and associate variables
 *
 *
 * @return  none
 */
void STM32MCP_flowControlHandler(uint8_t receivedByte)
{
    if(rxObj->currIndex < STM32MCP_RX_MSG_BUFF_LENGTH - 1)
       {
           //starting Frame processing
           if(rxObj->currIndex == 0x00)
           {
               if(STM32MCP_headPtr != NULL)
               {
                   //Reset the timer Counter
                   STM32MCP_timerManager->timerStop();
                   STM32MCP_timerManager->timerResetCounter();
                   STM32MCP_timerManager->timerStart();
                   if((receivedByte == 0xFF) || (receivedByte == 0xF0))
                   {
                       rxObj->rxMsgBuf[rxObj->currIndex++] = receivedByte;
                   }
                   //waiting for retransmission
               }
           }
           //Payload Length frame processing
           else if(rxObj->currIndex == 0x01)
           {
               //Reset the timer Counter
               STM32MCP_timerManager->timerStop();
               STM32MCP_timerManager->timerResetCounter();
               STM32MCP_timerManager->timerStart();
               rxObj->rxMsgBuf[rxObj->currIndex] = receivedByte;
               rxObj->payloadLength = rxObj->rxMsgBuf[rxObj->currIndex++];
           }
           //Data frame processing
           else if(rxObj->currIndex < rxObj->payloadLength + 0x03)
           {
               //Reset the timer Counter
               STM32MCP_timerManager->timerStop();
               STM32MCP_timerManager->timerResetCounter();
               STM32MCP_timerManager->timerStart();
               rxObj->rxMsgBuf[rxObj->currIndex++] = receivedByte;
           }

           //checksum frame processing
           if(rxObj->currIndex == rxObj->payloadLength + 0x03)
           {
               if(STM32MCP_calChecksum(rxObj->rxMsgBuf, rxObj->payloadLength + 2) == receivedByte)
               {
                   if(rxObj->rxMsgBuf[0] == 0xF0)
                   {
                       STM32MCP_timerManager->timerStop();
                       STM32MCP_timerManager->timerResetCounter();
                       STM32MCP_CBs->rxMsgCb(rxObj->rxMsgBuf,STM32MCP_headPtr);
                       //Next transmission
                       STM32MCP_dequeueMsg();
                       //GPIO_toggle(Board_GPIO_LED1);
                       if(!STM32MCP_queueIsEmpty())
                       {
                           STM32MCP_timerManager->timerStart();
                           if(STM32MCP_headPtr != NULL)
                           {
                               STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg, STM32MCP_headPtr->size);
                               //GPIO_toggle(Board_GPIO_LED1);
                           }
                           retransmissionCount = 0;
                       }
                   }
                   else if(rxObj->rxMsgBuf[0] == 0xFF)
                   {
                       if(STM32MCP_headPtr != NULL)
                       {
                           STM32MCP_CBs->erMsgCb(rxObj->rxMsgBuf[2]);
                       }
                       STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg, STM32MCP_headPtr->size);
                       //waiting for retransmission
                   }
               }
               STM32MCP_resetFlowControlhandler();
               //waiting for retransmission
           }
       }
       else
       {
           STM32MCP_resetFlowControlhandler();
           //Waiting for retransmission
       }
}
/*********************************************************************
 * @fn      STM32MCP_retransmission
 *
 * @brief   It is used for retransmission when timer overflows
 *
 * @param   None
 *
 *
 * @return  None
 */
void STM32MCP_retransmission()
{
    if(STM32MCP_headPtr!=NULL)
    {
        STM32MCP_timerManager->timerStart();
        STM32MCP_uartManager->uartWrite(STM32MCP_headPtr->txMsg, STM32MCP_headPtr->size);
        STM32MCP_resetFlowControlhandler();
        retransmissionCount ++;
        if(retransmissionCount >= STM32MCP_MAXIMUM_RETRANSMISSION_ALLOWANCE)
        {
            STM32MCP_CBs->exMsgCb(STM32MCP_EXCEED_MAXIMUM_RETRANSMISSION_ALLOWANCE); //Exception Handling
            //STM32MCP_closeCommunication(); //Disconnect UART Communication --> No Longer sends any data to the motor controller
            //ledControl_ErrorPriority(0x09);
        }
    }
}
/*********************************************************************
 * @fn      STM32MCP_initQueue
 *
 * @brief   To get set the head and tailPtr
 *
 * @param   None
 *
 *
 * @return  The size of the queue
 */
static void STM32MCP_initQueue()
{
    STM32MCP_headPtr = STM32MCP_tailPtr = NULL;
    STM32MCP_queueSize = 0;
}
/*********************************************************************
 * @fn      STM32MCP_getQueueSize
 *
 * @brief   To get the current size of the queue
 *
 * @param   None
 *
 *
 * @return  The size of the queue
 */
static uint8_t STM32MCP_getQueueSize()
{
    return STM32MCP_queueSize;
}
/*********************************************************************
 * @fn      STM32MCP_queueIsEmpty
 *
 * @brief   To check if he txMsg queue is empty
 *
 * @param   None
 *
 *
 * @return  None
 */
static uint8_t STM32MCP_queueIsEmpty()
{
    if(STM32MCP_headPtr == NULL && STM32MCP_tailPtr == NULL)
    {
        return 0x01;
    }
    else
    {
        return 0x00;
    }
}
/*********************************************************************
 * @fn      STM32MCP_enqueueMsg
 *
 * @param   *txMsg  The memory address of the fist byte of uart tx message
 *          size    The size of the uart tx message in number of bytes
 *
 *
 * @return  None
 */
static void STM32MCP_enqueueMsg(uint8_t *txMsg, uint8_t size)
{
    if(STM32MCP_getQueueSize() <= STM32MCP_MAXIMUM_NUMBER_OF_NODE)
    {
       STM32MCP_txMsgNode_t *temp;
       temp = (STM32MCP_txMsgNode_t *)malloc(sizeof(STM32MCP_txMsgNode_t));
       temp->txMsg = txMsg;
       temp->size = size;
       temp->next = NULL;
       if(STM32MCP_tailPtr == NULL)
       {
           STM32MCP_headPtr = STM32MCP_tailPtr = temp;
       }
       else
       {
           STM32MCP_tailPtr->next = temp;
           STM32MCP_tailPtr = temp;
       }
       STM32MCP_queueSize++;
    }
    else
    {
       //Throw expection
       STM32MCP_CBs->exMsgCb(STM32MCP_QUEUE_OVERLOAD);
       free(txMsg);
    }
}
/*********************************************************************
 * @fn      STM32MCP_dequeueMsg
 *
 * @brief   It is used for dequeuing the txMsg queue
 *
 * @param   None
 *
 *
 * @return  None
 */
static void STM32MCP_dequeueMsg()
{
    STM32MCP_txMsgNode_t *temp;
    if(STM32MCP_headPtr == NULL)
    {
        return;
    }
    else
    {
        temp = STM32MCP_headPtr;
        STM32MCP_headPtr = STM32MCP_headPtr->next;
        if(STM32MCP_headPtr == NULL)
        {
            STM32MCP_tailPtr = NULL;
        }
        STM32MCP_queueSize--;
        free(temp->txMsg);
        free(temp);
    }
}
/*********************************************************************
 * @fn      STM32MCP_emptyQueue
 *
 * @brief   It is used for empty the txMsg queue
 *
 * @param   None
 *
 *
 * @return  None
 */
static void STM32MCP_emptyQueue()
{
    while(!STM32MCP_queueIsEmpty())
    {
        STM32MCP_dequeueMsg();
    }
}
/*********************************************************************
 * @fn      STM32MCP_resetFlowControlhandler
 *
 * @brief   It is used for resetting the current Index and payloadLength
 *
 * @param   receivedByte: The byte received from uart receiver
 *          rxObj:      An object representing the received message and associate variables
 *
 *
 * @return  none
 */
static void STM32MCP_resetFlowControlhandler()
{
    rxObj->currIndex = 0x00;
    rxObj->payloadLength = 0xFF;
}
/*********************************************************************
 * @fn      STM32MCP_calChecksum
 *
 * @brief   It is used to calculate the checksum
 *
 * @param   *txMsg  The memory address of the fist byte of uart tx message
 *          size    The size of the uart tx message in number of bytes
 *
 *
 * @return  checksum of the txMessage
 */
static uint8_t STM32MCP_calChecksum(uint8_t *msg, uint8_t size)
{
    uint16_t total = 0;
    uint8_t n = 0;
    while(n != size)
    {
        total += msg[n];
        n++;
    }
    return (total & 0xFF) + ((total >> 8) & 0xFF);
}
